cf_billing/InformationRegisters/энргАктивностьТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВладельцыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВладельцыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АбонентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчетаМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет активные точки учета.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура АктивныеТочкиУчета(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргВладельцыТочекУчета.ТочкиУчетаМКД(Схема,ПараметрыОтбора, "ТочкиУчетаМКД");		
	Иначе
		ЕстьТочкиУчетаПомещения 		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ТочкиУчетаМКД" Тогда
				ЕстьТочкиУчетаПомещения = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьТочкиУчетаПомещения Тогда
			РегистрыСведений.энргВладельцыТочекУчета.ТочкиУчетаМКД(Схема,ПараметрыОтбора, "ТочкиУчетаМКД");		
		КонецЕсли;
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктивныеТочкиУчета());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет активные точки учета без ПУ.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура АктивныеТочкиУчетаБезПУ(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргСостояниеПриборовМКД.ДействующиеПриборыУчетаМКД(Схема,ПараметрыОтбора, "ДействующиеПриборыУчетаМКД");		
	Иначе
 		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеПриборыУчетаМКД" Тогда
				ЕстьТочкиУчетаПомещения = Истина;
 			КонецЕсли;		
		КонецЦикла;
		 
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктивныеТочкиУчетаМКДБезПУ());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	
	Если не Параметры.Количество() = 0 Тогда 
		ПараметрПериод 						= Параметры[0];
	КонецЕсли;
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаАктивныеТочкиУчета()
	
	Текст =
	"ВЫБРАТЬ
	|	АктивностьТочекУчета.Организация КАК Организация,
	|	АктивностьТочекУчета.Район КАК Район,
	|	АктивностьТочекУчета.МКД КАК МКД,
	|	АктивностьТочекУчета.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ТочкиУчетаМКД.Организация,
	|					ТочкиУчетаМКД.Район,
	|					ТочкиУчетаМКД.МКД,
	|					ТочкиУчетаМКД.ТочкаУчета
	|				ИЗ
	|					ТочкиУчетаМКД КАК ТочкиУчетаМКД)) КАК АктивностьТочекУчета
	|ГДЕ
	|	АктивностьТочекУчета.Состояние = ЗНАЧЕНИЕ(ПЕречисление.энргСостояниеТочекУчета.Включена)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаАктивныеТочкиУчетаМКДБезПУ()
	
	Текст =
	"ВЫБРАТЬ
	|	ДействующиеТочкиМКД.Организация КАК Организация,
	|	ДействующиеТочкиМКД.Район КАК Район,
	|	ДействующиеТочкиМКД.МКД КАК МКД,
	|	ДействующиеТочкиМКД.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	ДействующиеТочкиМКД КАК ДействующиеТочкиМКД
	|ГДЕ
	|	НЕ ДействующиеТочкиМКД.ТочкаУчета В
	|				(ВЫБРАТЬ
 	|					ПриборыДействующихТочек.ТочкаУчета
 	|				ИЗ
 	|					ПриборыДействующихТочек)";
 
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
